IdeaRS.OpenModel.Concrete.TwoWaySlabType
Two way slab types

IdeaRS.OpenModel.Concrete.TwoWaySlabType.Slab
slab model - only bending forces + shell

IdeaRS.OpenModel.Concrete.TwoWaySlabType.Wall
wall model - only membrane forces

IdeaRS.OpenModel.Concrete.TwoWaySlabType.DeepBeam
wall model - only membrane forces - detailing for deep beam

IdeaRS.OpenModel.Concrete.TwoWaySlabType.ShellAsPlate
shell model - all forces - detailing for slab

IdeaRS.OpenModel.Concrete.TwoWaySlabType.ShellAsWall
shell model - all forces - detailing for wall